CSI API ETABS v1
cLinkObj Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cLinkObj
Public Interface cLinkObj
Dim instance As cLinkObj
public interface class cLinkObj
type cLinkObj =  interface end
The cLinkObj type exposes the following members.
Methods
Name | Description
AddByCoord
 Adds a new link object whose end points are at the specified coordinates.
AddByPoint
 Adds a new link object whose end points are specified by name.
ChangeName
 Assigns a new name to an link object.
Count
 Retrieves the count of the link objects in the model.
Delete
 Deletes link objects.
GetElm
 Retrieves the name of the link element (analysis model link) associated with a specified link object in the object-based model.
GetGroupAssign
 Retrieves the groups to which a link object is assigned.
GetGUID
 Retrieves the GUID for the specified link object.
GetLocalAxes
 Retrieves the local axis angle assignment for link objects.
GetLocalAxesAdvanced
 Retrieves advanced local axes assignment for link objects.
GetNameList
 Retrieves the names of all defined link objects.
GetNameListOnStory
 Retrieves the names of the defined link objects on a given story.
GetPoints
 Retrieves the names of the point objects at each end of a specified link object. If names of the two point objects are the same, the specified link object is a one-joint link object.
GetProperty
 Retrieves the link property assigned to a link object.
GetSelected
 Retrieves the selected status for a link object.
GetTransformationMatrix
 Retrieves the transformation matrix for a link object.
SetGroupAssign
 Adds/removes link objects to/from a specified group.
SetGUID
 Sets the GUID for the specified link object. If the GUID is passed in as a blank string, the program automatically creates a GUID for the object.
SetLocalAxes
 Assigns a local axis angle to link objects.
SetLocalAxesAdvanced
 Assigns advanced local axes to link objects
SetProperty
 Assigns a link property to link objects.
SetSelected
 Sets the selected status for link objects.
Top
See Also
Reference
ETABSv1 Namespace